// utils/region-data.js
module.exports = {
  "广东省": {
    "广州市": ["天河区","海珠区","越秀区","荔湾区","白云区","黄埔区","番禺区","花都区","南沙区","从化区","增城区"],
    "深圳市": ["福田区","罗湖区","南山区","宝安区","龙岗区","龙华区","坪山区","光明区","盐田区","大鹏新区"],
    "珠海市": ["香洲区","金湾区","斗门区"],
    "佛山市": ["禅城区","南海区","顺德区","三水区","高明区"],
    "东莞市": ["东城街道","南城街道","万江街道","莞城街道","虎门镇","长安镇","厚街镇","塘厦镇","凤岗镇","其他"],
    "中山市": ["石岐街道","东区街道","西区街道","南区街道","火炬开发区","小榄镇","古镇镇","其他"],
    "惠州市": ["惠城区","惠阳区","博罗县","惠东县","龙门县"],
    "汕头市": ["金平区","龙湖区","濠江区","潮阳区","潮南区","澄海区","南澳县"],
    "江门市": ["蓬江区","江海区","新会区","台山市","开平市","鹤山市","恩平市"],
    "湛江市": ["赤坎区","霞山区","坡头区","麻章区","遂溪县","徐闻县","廉江市","雷州市","吴川市"],
    "茂名市": ["茂南区","电白区","高州市","化州市","信宜市"],
    "肇庆市": ["端州区","鼎湖区","高要区","广宁县","怀集县","封开县","德庆县","四会市"],
    "梅州市": ["梅江区","梅县区","大埔县","丰顺县","五华县","平远县","蕉岭县","兴宁市"],
    "汕尾市": ["城区","海丰县","陆河县","陆丰市"],
    "河源市": ["源城区","紫金县","龙川县","连平县","和平县","东源县"],
    "阳江市": ["江城区","阳东区","阳西县","阳春市"],
    "清远市": ["清城区","清新区","佛冈县","阳山县","连山壮族瑶族自治县","连南瑶族自治县","英德市","连州市"],
    "潮州市": ["湘桥区","潮安区","饶平县"],
    "揭阳市": ["榕城区","揭东区","揭西县","惠来县","普宁市"],
    "云浮市": ["云城区","云安区","新兴县","郁南县","罗定市"]
  },
  "北京市": { "北京市": ["东城区","西城区","朝阳区","海淀区","丰台区","石景山区","通州区","昌平区","大兴区","其他"] },
  "上海市": { "上海市": ["黄浦区","徐汇区","长宁区","静安区","普陀区","虹口区","杨浦区","浦东新区","闵行区","宝山区","其他"] },
  "天津市": { "天津市": ["和平区","河东区","河西区","南开区","河北区","红桥区","滨海新区","东丽区","西青区","其他"] },
  "重庆市": { "重庆市": ["渝中区","江北区","沙坪坝区","九龙坡区","南岸区","渝北区","巴南区","其他"] },
  "浙江省": {
    "杭州市": ["西湖区","上城区","拱墅区","滨江区","余杭区","萧山区","临平区","钱塘区","其他"],
    "宁波市": ["海曙区","江北区","镇海区","北仑区","鄞州区","其他"],
    "温州市": ["鹿城区","龙湾区","瓯海区","其他"]
  },
  "江苏省": {
    "南京市": ["玄武区","秦淮区","建邺区","鼓楼区","栖霞区","雨花台区","江宁区","其他"],
    "苏州市": ["姑苏区","虎丘区","吴中区","相城区","吴江区","其他"]
  },
  "福建省": {
    "福州市": ["鼓楼区","台江区","仓山区","晋安区","马尾区","其他"],
    "厦门市": ["思明区","湖里区","集美区","海沧区","同安区","翔安区"]
  },
  "湖南省": { "长沙市": ["芙蓉区","天心区","岳麓区","开福区","雨花区","望城区","其他"] },
  "湖北省": { "武汉市": ["江岸区","江汉区","硚口区","汉阳区","武昌区","青山区","洪山区","其他"] },
  "四川省": { "成都市": ["锦江区","青羊区","金牛区","武侯区","成华区","高新区","其他"] },
  "山东省": {
    "济南市": ["历下区","市中区","槐荫区","天桥区","历城区","其他"],
    "青岛市": ["市南区","市北区","李沧区","崂山区","黄岛区","其他"]
  },
  "河南省": { "郑州市": ["中原区","二七区","管城回族区","金水区","惠济区","其他"] },
  "陕西省": { "西安市": ["新城区","碑林区","莲湖区","雁塔区","未央区","灞桥区","其他"] },
  "广西壮族自治区": {
    "南宁市": ["青秀区","兴宁区","西乡塘区","江南区","良庆区","邕宁区","其他"],
    "桂林市": ["秀峰区","叠彩区","象山区","七星区","雁山区","其他"]
  },
  "海南省": {
    "海口市": ["秀英区","龙华区","琼山区","美兰区"],
    "三亚市": ["海棠区","吉阳区","天涯区","崖州区"]
  }
};
